<!-- attach-outputs:plan-nodes-prod.txt -->
  <!-- Output: plan-nodes-prod.txt -->
  #### plan-nodes-prod.txt 📖: `test: success, prod: success`

  **Last updated:** Jan 4, 2026, 05:05 PM UTC

  <details><summary>Show Contents</summary>

  ```

  
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.cluster.module.talos-vm["tiles-cp-1"].proxmox_virtual_environment_vm.main has changed
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7211"
        name                                 = "tiles-cp-1"
      ~ network_interface_names              = [
            # (13 unchanged elements hidden)
            "lxcb5c8bf236c09",
          ~ "lxca86beb6e5833" -> "lxcfa46a3036fd3",
          ~ "lxcfa46a3036fd3" -> "lxc104b0e1a36f8",
          ~ "lxc104b0e1a36f8" -> "lxccf9c7e83c049",
          ~ "lxccf9c7e83c049" -> "lxcb7f46f027ba3",
          ~ "lxcb7f46f027ba3" -> "lxcb56f3e85d3c6",
          ~ "lxcb56f3e85d3c6" -> "lxc4e973e7447c6",
          ~ "lxc67f6357d3fa6" -> "lxca1b7ea2b56d3",
        ]
        tags                                 = []
        # (33 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-wk-1"].proxmox_virtual_environment_vm.main has changed
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7221"
      ~ ipv4_addresses                       = [
            # (7 unchanged elements hidden)
            [
                "10.0.128.21",
            ],
          + [],
          + [
              + "10.0.149.116",
            ],
          + [],
          + [],
          + [],
          + [],
          + [],
        ]
      ~ ipv6_addresses                       = [
            # (7 unchanged elements hidden)
            [
                "fe80::be24:11ff:fed0:7221",
            ],
          + [
              + "fe80::dc17:d8ff:fe70:178c",
            ],
          + [
              + "fe80::a85e:a9ff:fea4:c104",
            ],
          + [
              + "fe80::200:ff:fe00:0",
            ],
          + [
              + "fe80::200:ff:fe00:0",
            ],
          + [
              + "fe80::200:ff:fe00:0",
            ],
          + [
              + "fe80::200:ff:fe00:0",
            ],
          + [
              + "fe80::200:ff:fe00:0",
            ],
        ]
      ~ mac_addresses                        = [
            # (7 unchanged elements hidden)
            "BC:24:11:D0:72:21",
          + "DE:17:D8:70:17:8C",
          + "AA:5E:A9:A4:C1:04",
          + "00:00:00:00:00:00",
          + "00:00:00:00:00:00",
          + "00:00:00:00:00:00",
          + "00:00:00:00:00:00",
          + "00:00:00:00:00:00",
        ]
        name                                 = "tiles-wk-1"
      ~ network_interface_names              = [
            # (7 unchanged elements hidden)
            "eth0",
          + "cilium_net",
          + "cilium_host",
          + "lxcca74546f8ab1",
          + "lxc_health",
          + "lxcfb482f7aa8a0",
          + "lxcef068134b074",
          + "lxcd9715b7e676c",
        ]
        tags                                 = []
        # (30 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-wk-2"].proxmox_virtual_environment_vm.main has changed
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7222"
      ~ ipv4_addresses                       = [
            # (23 unchanged elements hidden)
            [],
          + [],
          + [],
        ]
      ~ ipv6_addresses                       = [
            # (23 unchanged elements hidden)
            [
                "fe80::200:ff:fe00:0",
            ],
          + [
              + "fe80::200:ff:fe00:0",
            ],
          + [
              + "fe80::200:ff:fe00:0",
            ],
        ]
      ~ mac_addresses                        = [
            # (23 unchanged elements hidden)
            "00:00:00:00:00:00",
          + "00:00:00:00:00:00",
          + "00:00:00:00:00:00",
        ]
        name                                 = "tiles-wk-2"
      ~ network_interface_names              = [
            # (23 unchanged elements hidden)
            "lxc8fce1776303c",
          + "lxc7d7e6d0e78c1",
          + "lxcb0b0d5ffeddd",
        ]
        tags                                 = []
        # (30 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-wk-3"].proxmox_virtual_environment_vm.main has changed
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7223"
      ~ ipv4_addresses                       = [
            # (23 unchanged elements hidden)
            [],
          + [],
          + [],
        ]
      ~ ipv6_addresses                       = [
            # (23 unchanged elements hidden)
            [
                "fe80::200:ff:fe00:0",
            ],
          + [
              + "fe80::200:ff:fe00:0",
            ],
          + [
              + "fe80::200:ff:fe00:0",
            ],
        ]
      ~ mac_addresses                        = [
            # (23 unchanged elements hidden)
            "00:00:00:00:00:00",
          + "00:00:00:00:00:00",
          + "00:00:00:00:00:00",
        ]
        name                                 = "tiles-wk-3"
      ~ network_interface_names              = [
            # (23 unchanged elements hidden)
            "lxcfaf9f6bceeab",
          + "lxcd432f385d0e9",
          + "lxc6fdc3aa66ac8",
        ]
        tags                                 = []
        # (30 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.cluster.onepassword_item.misc_config[0] will be updated in-place
  ~ resource "onepassword_item" "misc_config" {
        id       = "vaults/lyyqeg3pe6dvqdeb5hbiu7b76y/items/txizvv5dzvi7kbg5ktq5ngjpsi"
      + password = (sensitive value)
        # (4 unchanged attributes hidden)

      ~ section {
            id    = "ab2a327c-f3a1-12c9-8d38-26da063ef8cb"
            # (1 unchanged attribute hidden)

          ~ field {
                id    = "451de12e-9c3a-08fc-ff48-3e47d18e7560"
              ~ value = (sensitive value)
                # (2 unchanged attributes hidden)
            }

            # (15 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.cluster.module.talos-vm["tiles-cp-1"].proxmox_virtual_environment_vm.main is tainted, so must be replaced
-/+ resource "proxmox_virtual_environment_vm" "main" {
      ~ boot_order                           = [
          - "ide2",
          - "scsi0",
          - "net0",
        ] -> (known after apply)
      ~ id                                   = "7211" -> (known after apply)
      ~ ipv4_addresses                       = [
          - [
              - "127.0.0.1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "10.0.128.11",
              - "10.0.128.10",
            ],
          - [],
          - [
              - "10.0.144.125",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
        ] -> (known after apply)
      ~ ipv6_addresses                       = [
          - [
              - "::1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "fe80::be24:11ff:fed0:7211",
            ],
          - [
              - "fe80::9008:d0ff:fe0e:cc1a",
            ],
          - [
              - "fe80::a46a:66ff:fef7:6b53",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
        ] -> (known after apply)
      ~ mac_addresses                        = [
          - "00:00:00:00:00:00",
          - "22:D3:F4:3E:FA:43",
          - "26:C9:CC:D4:4D:D6",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "BC:24:11:D0:72:11",
          - "92:08:D0:0E:CC:1A",
          - "A6:6A:66:F7:6B:53",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
        ] -> (known after apply)
        name                                 = "tiles-cp-1"
      ~ network_interface_names              = [
          - "lo",
          - "bond0",
          - "dummy0",
          - "teql0",
          - "tunl0",
          - "sit0",
          - "ip6tnl0",
          - "eth0",
          - "cilium_net",
          - "cilium_host",
          - "lxc_health",
          - "lxc2676a59cd331",
          - "lxc03b8ab6d0664",
          - "lxcb5c8bf236c09",
          - "lxcfa46a3036fd3",
          - "lxc104b0e1a36f8",
          - "lxccf9c7e83c049",
          - "lxcb7f46f027ba3",
          - "lxcb56f3e85d3c6",
          - "lxc4e973e7447c6",
          - "lxca1b7ea2b56d3",
        ] -> (known after apply)
        tags                                 = []
        # (29 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
          ~ units        = 0 -> (known after apply)
            # (8 unchanged attributes hidden)
        }

      ~ disk {
          ~ path_in_datastore = "vm-7211-disk-0" -> (known after apply)
            # (14 unchanged attributes hidden)
        }

      ~ network_device {
          - disconnected = false -> null
            # (10 unchanged attributes hidden)
        }

      ~ vga (known after apply)

        # (4 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-cp-2"].proxmox_virtual_environment_vm.main is tainted, so must be replaced
-/+ resource "proxmox_virtual_environment_vm" "main" {
      ~ boot_order                           = [
          - "ide2",
          - "scsi0",
          - "net0",
        ] -> (known after apply)
      ~ id                                   = "7212" -> (known after apply)
      ~ ipv4_addresses                       = [
          - [
              - "127.0.0.1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "10.0.128.12",
            ],
          - [],
          - [
              - "10.0.145.179",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
        ] -> (known after apply)
      ~ ipv6_addresses                       = [
          - [
              - "::1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "fe80::be24:11ff:fed0:7212",
            ],
          - [
              - "fe80::d400:1cff:febd:f86f",
            ],
          - [
              - "fe80::b038:a7ff:fe6e:90d0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
        ] -> (known after apply)
      ~ mac_addresses                        = [
          - "00:00:00:00:00:00",
          - "36:90:9D:99:FE:76",
          - "46:4E:F5:BE:B2:01",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "BC:24:11:D0:72:12",
          - "D6:00:1C:BD:F8:6F",
          - "B2:38:A7:6E:90:D0",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
        ] -> (known after apply)
        name                                 = "tiles-cp-2"
      ~ network_interface_names              = [
          - "lo",
          - "bond0",
          - "dummy0",
          - "teql0",
          - "tunl0",
          - "sit0",
          - "ip6tnl0",
          - "ens18",
          - "cilium_net",
          - "cilium_host",
          - "lxc_health",
          - "lxc2445b29f9bd6",
          - "lxc791d6550c30d",
          - "lxc2405c6117d0b",
          - "lxc6ba92a4232a5",
        ] -> (known after apply)
        tags                                 = []
        # (29 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
          ~ units        = 0 -> (known after apply)
            # (8 unchanged attributes hidden)
        }

      ~ disk {
          ~ path_in_datastore = "vm-7212-disk-0" -> (known after apply)
            # (14 unchanged attributes hidden)
        }

      ~ network_device {
          - disconnected = false -> null
            # (10 unchanged attributes hidden)
        }

      ~ vga (known after apply)

        # (4 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-cp-3"].proxmox_virtual_environment_vm.main is tainted, so must be replaced
-/+ resource "proxmox_virtual_environment_vm" "main" {
      ~ boot_order                           = [
          - "ide2",
          - "scsi0",
          - "net0",
        ] -> (known after apply)
      ~ id                                   = "7213" -> (known after apply)
      ~ ipv4_addresses                       = [
          - [
              - "127.0.0.1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "10.0.128.13",
            ],
          - [],
          - [
              - "10.0.146.74",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
        ] -> (known after apply)
      ~ ipv6_addresses                       = [
          - [
              - "::1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "fe80::be24:11ff:fed0:7213",
            ],
          - [
              - "fe80::c49b:f4ff:fe03:aa05",
            ],
          - [
              - "fe80::a0b9:daff:feb4:68c6",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
        ] -> (known after apply)
      ~ mac_addresses                        = [
          - "00:00:00:00:00:00",
          - "D2:6B:86:1B:6A:64",
          - "3E:84:AF:07:AD:E4",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "BC:24:11:D0:72:13",
          - "C6:9B:F4:03:AA:05",
          - "A2:B9:DA:B4:68:C6",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
        ] -> (known after apply)
        name                                 = "tiles-cp-3"
      ~ network_interface_names              = [
          - "lo",
          - "bond0",
          - "dummy0",
          - "teql0",
          - "tunl0",
          - "sit0",
          - "ip6tnl0",
          - "ens18",
          - "cilium_net",
          - "cilium_host",
          - "lxc_health",
          - "lxc833115ae135a",
          - "lxc71ae2d284abf",
          - "lxc9a175726c3f8",
          - "lxc7b77a11a7226",
          - "lxc60816f9c276b",
        ] -> (known after apply)
        tags                                 = []
        # (29 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
          ~ units        = 0 -> (known after apply)
            # (8 unchanged attributes hidden)
        }

      ~ disk {
          ~ path_in_datastore = "vm-7213-disk-0" -> (known after apply)
            # (14 unchanged attributes hidden)
        }

      ~ network_device {
          - disconnected = false -> null
            # (10 unchanged attributes hidden)
        }

      ~ vga (known after apply)

        # (4 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-wk-1"].proxmox_virtual_environment_vm.main is tainted, so must be replaced
-/+ resource "proxmox_virtual_environment_vm" "main" {
      ~ boot_order                           = [
          - "ide2",
          - "scsi0",
          - "net0",
        ] -> (known after apply)
      ~ id                                   = "7221" -> (known after apply)
      ~ ipv4_addresses                       = [
          - [
              - "127.0.0.1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "10.0.128.21",
            ],
          - [],
          - [
              - "10.0.149.116",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
        ] -> (known after apply)
      ~ ipv6_addresses                       = [
          - [
              - "::1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "fe80::be24:11ff:fed0:7221",
            ],
          - [
              - "fe80::dc17:d8ff:fe70:178c",
            ],
          - [
              - "fe80::a85e:a9ff:fea4:c104",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
        ] -> (known after apply)
      ~ mac_addresses                        = [
          - "00:00:00:00:00:00",
          - "E6:CC:82:09:08:2A",
          - "FA:79:A4:1B:AE:18",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "BC:24:11:D0:72:21",
          - "DE:17:D8:70:17:8C",
          - "AA:5E:A9:A4:C1:04",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
        ] -> (known after apply)
        name                                 = "tiles-wk-1"
      ~ network_interface_names              = [
          - "lo",
          - "bond0",
          - "dummy0",
          - "teql0",
          - "tunl0",
          - "sit0",
          - "ip6tnl0",
          - "eth0",
          - "cilium_net",
          - "cilium_host",
          - "lxcca74546f8ab1",
          - "lxc_health",
          - "lxcfb482f7aa8a0",
          - "lxcef068134b074",
          - "lxcd9715b7e676c",
        ] -> (known after apply)
        tags                                 = []
        # (29 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
          ~ units        = 0 -> (known after apply)
            # (8 unchanged attributes hidden)
        }

      ~ disk {
          ~ path_in_datastore = "vm-7221-disk-0" -> (known after apply)
            # (14 unchanged attributes hidden)
        }

      ~ network_device {
          - disconnected = false -> null
            # (10 unchanged attributes hidden)
        }

      ~ vga (known after apply)

        # (4 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-wk-2"].proxmox_virtual_environment_vm.main is tainted, so must be replaced
-/+ resource "proxmox_virtual_environment_vm" "main" {
      ~ boot_order                           = [
          - "ide2",
          - "scsi0",
          - "net0",
        ] -> (known after apply)
      ~ id                                   = "7222" -> (known after apply)
      ~ ipv4_addresses                       = [
          - [
              - "127.0.0.1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "10.0.128.22",
            ],
          - [],
          - [
              - "10.0.147.3",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
        ] -> (known after apply)
      ~ ipv6_addresses                       = [
          - [
              - "::1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "fe80::be24:11ff:fed0:7222",
            ],
          - [
              - "fe80::6006:efff:fe9b:1664",
            ],
          - [
              - "fe80::8849:52ff:feff:c7e5",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
        ] -> (known after apply)
      ~ mac_addresses                        = [
          - "00:00:00:00:00:00",
          - "BA:0B:65:D0:DC:DE",
          - "26:E6:3F:D1:85:B5",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "BC:24:11:D0:72:22",
          - "62:06:EF:9B:16:64",
          - "8A:49:52:FF:C7:E5",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
        ] -> (known after apply)
        name                                 = "tiles-wk-2"
      ~ network_interface_names              = [
          - "lo",
          - "bond0",
          - "dummy0",
          - "teql0",
          - "tunl0",
          - "sit0",
          - "ip6tnl0",
          - "ens18",
          - "cilium_net",
          - "cilium_host",
          - "lxc_health",
          - "lxcc4dda0c34755",
          - "lxccd8ebbbc958d",
          - "lxc8e8a4becfefe",
          - "lxc1be24072b41b",
          - "lxc33cb58a7291f",
          - "lxc1a57a810e441",
          - "lxcd474c1a48906",
          - "lxcecb023557c7b",
          - "lxca1db83443a53",
          - "lxc0a9cf04ca6e6",
          - "lxc48218fd99f57",
          - "lxc5705f2aa7990",
          - "lxc8fce1776303c",
          - "lxc7d7e6d0e78c1",
          - "lxcb0b0d5ffeddd",
        ] -> (known after apply)
        tags                                 = []
        # (29 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
          ~ units        = 0 -> (known after apply)
            # (8 unchanged attributes hidden)
        }

      ~ disk {
          ~ path_in_datastore = "vm-7222-disk-0" -> (known after apply)
            # (14 unchanged attributes hidden)
        }

      ~ network_device {
          - disconnected = false -> null
            # (10 unchanged attributes hidden)
        }

      ~ vga (known after apply)

        # (4 unchanged blocks hidden)
    }

  # module.cluster.module.talos-vm["tiles-wk-3"].proxmox_virtual_environment_vm.main is tainted, so must be replaced
-/+ resource "proxmox_virtual_environment_vm" "main" {
      ~ boot_order                           = [
          - "ide2",
          - "scsi0",
          - "net0",
        ] -> (known after apply)
      ~ id                                   = "7223" -> (known after apply)
      ~ ipv4_addresses                       = [
          - [
              - "127.0.0.1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "10.0.128.23",
            ],
          - [],
          - [
              - "10.0.148.198",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
        ] -> (known after apply)
      ~ ipv6_addresses                       = [
          - [
              - "::1",
            ],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [],
          - [
              - "fe80::be24:11ff:fed0:7223",
            ],
          - [
              - "fe80::f0d2:e3ff:fe64:2bf5",
            ],
          - [
              - "fe80::70ed:8eff:fe1d:1aab",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
          - [
              - "fe80::200:ff:fe00:0",
            ],
        ] -> (known after apply)
      ~ mac_addresses                        = [
          - "00:00:00:00:00:00",
          - "F6:29:1C:EF:2F:06",
          - "B2:FF:69:F1:82:CA",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "BC:24:11:D0:72:23",
          - "F2:D2:E3:64:2B:F5",
          - "72:ED:8E:1D:1A:AB",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
          - "00:00:00:00:00:00",
        ] -> (known after apply)
        name                                 = "tiles-wk-3"
      ~ network_interface_names              = [
          - "lo",
          - "bond0",
          - "dummy0",
          - "teql0",
          - "tunl0",
          - "sit0",
          - "ip6tnl0",
          - "ens18",
          - "cilium_net",
          - "cilium_host",
          - "lxc_health",
          - "lxc4bd88edadb7e",
          - "lxc2c7a99531d38",
          - "lxc42327e834274",
          - "lxc30c52888a5fd",
          - "lxc3371df554495",
          - "lxcde9318be7734",
          - "lxc2812bae73bd3",
          - "lxc96f683be8509",
          - "lxcc4a14a8cd086",
          - "lxc93a2ff3a60bf",
          - "lxc2aa08fca3c39",
          - "lxc206251c30aca",
          - "lxcfaf9f6bceeab",
          - "lxcd432f385d0e9",
          - "lxc6fdc3aa66ac8",
        ] -> (known after apply)
        tags                                 = []
        # (29 unchanged attributes hidden)

      ~ cpu {
          - flags        = [] -> null
          ~ units        = 0 -> (known after apply)
            # (8 unchanged attributes hidden)
        }

      ~ disk {
          ~ path_in_datastore = "vm-7223-disk-0" -> (known after apply)
            # (14 unchanged attributes hidden)
        }

      ~ network_device {
          - disconnected = false -> null
            # (10 unchanged attributes hidden)
        }

      ~ vga (known after apply)

        # (4 unchanged blocks hidden)
    }

Plan: 6 to add, 1 to change, 6 to destroy.

  ```

  </details>
  
  